snlkuharlocal/src/Documents/ЗадачиАСУ/ЗадачиАСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗадачиАСУ</name>
  <basedOn>Document.ЗадачиАСУ</basedOn>
  <basedOn>Document.Совещание</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗадачи</name>
    <type>
      <types>CatalogRef.СостояниеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПостановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФактическогоНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзмененияТЗ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботыПоПоследнемуИзменению</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияПоТекущемуТЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеОписаниеЗадачи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаВремени</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияЗадачи</name>
    <type>
      <types>EnumRef.КатегорииЗадачАсу</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЗадача</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеЗаказчика</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнителя</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Совещание</name>
    <type>
      <types>DocumentRef.Совещание</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Распределена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПланируемогоОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФактическогоОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПланируемогоНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеальныйИсполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НастоящийИсполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаИзСогласованногоПлана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненПлан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненФакт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесПроцессАСУ</name>
    <type>
      <types>CatalogRef.БизнесПроцессАСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетАСУ</name>
    <type>
      <types>EnumRef.ПриоритетАСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Дедлайн</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачиАСУ</name>
    <type>
      <types>CatalogRef.ВидЗадачиАСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПостановкиЗадачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредполагаемаяПродолжительностьВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяДатаПланируемогоОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяДатаПланируемогоНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеФайлы</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыПроекта</name>
    <attributes>
      <name>ОписаниеЭтапа</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/Календарь/Календарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Календарь</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Дни</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздничныйДень</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузкаВВыходной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Documents/ЗадачиАСУ/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗадачиАСУ") Тогда
		// Заполнение шапки
		Заказчик = ДанныеЗаполнения.Заказчик;
		КатегорияЗадачи = ДанныеЗаполнения.КатегорияЗадачи;
		НаименованиеЗадачи = ДанныеЗаполнения.НаименованиеЗадачи;
		ПодразделениеЗаказчика = ДанныеЗаполнения.ПодразделениеЗаказчика;
		ПодразделениеИсполнителя = ДанныеЗаполнения.ПодразделениеИсполнителя;
		ОсновнаяЗадача = ДанныеЗаполнения.ссылка;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Совещание") Тогда
		// Заполнение шапки
		Совещание = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	
	
	
	// Кухарь А.Ю.  09.08.2022 начало
	//
	ДатаНачалаРаботыПоПоследнемуИзменению=ПустаяДата();
	ДатаФактическогоНачала=ПустаяДата();
	ДатаПланируемогоНачала=ПустаяДата();
	ДатаФактическогоНачала=ПустаяДата();
	ДатаПланируемогоОкончания=ПустаяДата();
	ДатаПостановки=ПустаяДата();
	ЗадачаИзСогласованногоПлана=Ложь;
	// Кухарь А.Ю.  09.08.2022 конец
	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	    
ЭтотОбъект.Автор = параметрысеанса.Пользователь.ФизЛицо;

// Кухарь А.Ю.  09.08.2022 начало
//
ДатаНачалаРаботыПоПоследнемуИзменению=ПустаяДата();
ДатаФактическогоНачала=ПустаяДата();
ДатаПланируемогоНачала=ПустаяДата();
ДатаФактическогоНачала=ПустаяДата();
ДатаПланируемогоОкончания=ПустаяДата();
ДатаПостановки=ПустаяДата();
ЗадачаИзСогласованногоПлана=Ложь;
// Кухарь А.Ю.  09.08.2022 конец


КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	если ЗначениеЗаполнено(Исполнитель) и ЗначениеЗаполнено(Исполнитель.Подразделение) тогда
		ПодразделениеИсполнителя=Исполнитель.Подразделение;
	КонецЕсли;
	
	если ЗначениеЗаполнено(ПродолжительностьДни) и ЗначениеЗаполнено(ДатаПланируемогоНачала) тогда
		Запрос=новый запрос;
		запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
		|	КалендарьДни.Дата КАК Дата
		|ПОМЕСТИТЬ ВремТЗ
		|ИЗ
		|	Справочник.Календарь.Дни КАК КалендарьДни
		|ГДЕ
		|	НЕ КалендарьДни.Ссылка.ПометкаУдаления
		|	И КалендарьДни.Дата > &Дата
		|	И КалендарьДни.Часы = 8
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВремТЗ.Дата КАК Дата
		|ИЗ
		|	ВремТЗ КАК ВремТЗ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
		запрос.УстановитьПараметр("Дата",ДатаПланируемогоНачала);
		запрос.Текст=СтрЗаменить(запрос.Текст," ПЕРВЫЕ 100", " ПЕРВЫЕ "+Строка(ПродолжительностьДни));
		результат=запрос.Выполнить().выбрать();
		пока результат.Следующий() цикл
			ДатаПланируемогоОкончания=результат.дата;
		КонецЦикла; 			
	КонецЕсли;
КонецПроцедуры
